blog/2014-05-27-ji-yu-axis,-xfire,-cxfde-webserviceke-hu-duan.org
#+AUTHOR: Kinhung Lam
#+EMAIL: linjxljx@gmail.com
#+TITLE: A Client of Webservice by Axis/XFire/CXF 
#+DATE: <2014-05-27 TUE 14:59>

##Axis客户端调用 webservice

#+begin_example
URL endpointURL = new URL("http://localhost:8080/webservice/HelloService");  
            String requestText = "javalinjx"  
            Service service = new Service();  
            Call call = (Call) service.createCall();  
            call.setTargetEndpointAddress(endpointURL);  
            call.setOperationName("sayHello");  
            call.addParameter("xml", XMLType.XSD_STRING, ParameterMode.IN);  
            call.setReturnClass(String.class);  
            call.setReturnType(XMLType.XSD_STRING);// 设置返回类型  
            Object [] obj = new Object[]{ requestText };  
            String result = (String) call.invoke(obj);
#+end_example

#+MORE_LINK:

##XFire客户端调用

#+begin_example
public void call() throws Exception {  
        Service service = new ObjectServiceFactory().create(HelloService.class);  
        XFireProxyFactory factory = new XFireProxyFactory(XFireFactory.newInstance().getXFire());  
        String url = "http://localhost:8080/webservice/HelloService";  
        SmsService it = (SmsService)factory.create(service, url);  
        int b = it.sayHello("javalinjx");  
    }
#+end_example

##CXF客户端调用

#+begin_example
JaxWsProxyFactoryBean factory1 = new JaxWsProxyFactoryBean();  
factory1.setServiceClass(UaAuthInterfaces.class);  
        factory1.setAddress("http://localhost:8080/webservices/HelloService");  
        UaAuthInterfaces u = (UaAuthInterfaces) factory1.create();  
                u.sayHello("javalinjx");
#+end_example
